$(document).ready(function() {
  var news = [{
    "date": "ماي 2025",
    "prefix": "الوجيز: رسميا",
    "heading": "إعلان رسمي بخصوص توقف مشروع الوجيز.",
  }, {
    "date": "ماي 2025",
    "prefix": "الوجيز: رسمي",
    "heading": "نود إعلام المستخدمين الكرام بأن مشروع الوجيز قد تم إيقافه رسميًا.",
  }, {
    "date": "ماي 2025",
    "prefix": "الوجيز: رسمي",
    "heading": "وقد تم تسليم المشروع بشكل كامل إلى صاحب الفكرة، الأستاذ/ة مستشارة التوجيه والارشاد المدرسي والمهني قاسي صارة، مع كامل الملفات والمخرجات المتعلقة به.",
  }, {
    "date": "ماي 2025",
    "prefix": "الوجيز: رسمي",
    "heading": "تجدر الإشارة إلى أن صاحبة الفكرة، الأستاذة قاسي صارة، تابعت المشروع منذ بدايته في سنة 2021 وحتى عام 2024، وقد كانت حريصة طوال هذه الفترة على تطويره وتحقيق أهدافه.",
  }, {
    "date": "ماي 2025",
    "prefix": "الوجيز: رسمي",
    "heading": "وقد تم الآن تسليم المشروع بالكامل لها.",
  }, {
    "date": "ماي 2025",
    "prefix": "الوجيز: رسمي",
    "heading": "نحن فخورون بكل ما تم إنجازه خلال الفترة الماضية، ونشكر كل من تابعنا وساندنا.",
  }, {
    "date": "ماي 2025",
    "prefix": "الوجيز: رسمي",
    "heading": "ونتمنى لصاحبة الفكرة كل التوفيق في استكمال المسار بالطريقة التي تراها مناسبة.",
    }];

  $("#newsTicker1").easyNewsTicker({
    "animation": {
      "effect": "scroll",
    },
    "data": news
  });

  // THEMES
  for(var i = 1; i <= 10; i++) {
    $("#newsTicker_theme"+i).easyNewsTicker({
      "theme": i,
      "animation": {
        "effect": "slide-vertical",
        "easing": "easeInOutExpo",
        "duration": 1000
      },
      "data": news
    });
  }
});
